tap "homebrew/cask-fonts" if OS.mac?  # for font-jetbrains-mono-nerd-font

cask_args appdir: "~/Applications", require_sha: true

brew "atuin"
brew "bat"
brew "black"
brew "boost"
brew "clang-format"
brew "cmake"
brew "curl"
brew "difftastic"
brew "fd"  # for telescope.nvim
brew "ffmpeg"  # for youtube-dl
brew "fzf"
brew "gh"
brew "git-delta"
brew "graphviz"
brew "gzip"
brew "htop"
# brew "httrack"
brew "hyperfine"
brew "jq"
brew "ripgrep"
brew "libarchive"
brew "libgit2"
brew "llvm"  # clangd clang-format clang-tidy
brew "lsd"
brew "lua-language-server"
# brew "mysql"  # for mysqlclient of Python
brew "ninja"
brew "neovim"
brew "node"  # for copilot.vim
brew "poetry"
brew "python"
brew "python-lsp-server"
brew "starship"
brew "subversion"  # for font-source-code-pro-for-powerline
brew "tmux"
brew "topgrade"
brew "trash" if OS.mac?
brew "universal-ctags"
# brew "valgrind"
brew "vhs"
brew "wget"
brew "wrk"
brew "youtube-dl"

# cask "1password"
cask "1password-cli"
cask "alacritty"
# cask "balenaetcher"  # Flash OS images to SD cards & USB drives, safely and easily.
cask "brave-browser"
cask "deepl"
cask "discord"
# cask "figma"
cask "font-jetbrains-mono-nerd-font"  # for alacritty
cask "font-source-code-pro-for-powerline"
# cask "google-cloud-sdk"
cask "jordanbaird-ice"
cask "languagetool"
# cask "mactex-no-gui"
cask "postman"
cask "raycast"
cask "rectangle"
cask "signal"
cask "standard-notes"
cask "visual-studio-code"
